best_model_tnt_invpyramid.h5


best_model_tnt_invpyramid.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 300, 100, 100, 1)  0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 299, 99, 99, 2)    18        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 149, 49, 49, 2)    0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 149, 49, 49, 2)    8         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 148, 48, 48, 4)    68        
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 74, 24, 24, 4)     0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 74, 24, 24, 4)     16        
_________________________________________________________________
flatten_1 (Flatten)          (None, 170496)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               21823616  
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 21,823,855
Trainable params: 21,823,843
Non-trainable params: 12
_________________________________________________________________
None
best_model_tnt_pyramid.h5


best_model_tnt_pyramid.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 300, 100, 100, 1)  0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 299, 99, 99, 8)    72        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 149, 49, 49, 8)    0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 149, 49, 49, 8)    32        
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 148, 48, 48, 4)    260       
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 74, 24, 24, 4)     0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 74, 24, 24, 4)     16        
_________________________________________________________________
flatten_1 (Flatten)          (None, 170496)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               21823616  
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 21,824,125
Trainable params: 21,824,101
Non-trainable params: 24
_________________________________________________________________
None
best_model_tnt_single.h5


best_model_tnt_single.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 300, 100, 100, 1)  0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 299, 99, 99, 2)    18        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 149, 49, 49, 2)    0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 149, 49, 49, 2)    8         
_________________________________________________________________
flatten_1 (Flatten)          (None, 715498)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               91583872  
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 91,584,027
Trainable params: 91,584,023
Non-trainable params: 4
_________________________________________________________________
None
best_model_tnt_single_of.h5


best_model_tnt_single_of.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 299, 100, 100, 2)  0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 298, 99, 99, 2)    34        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 149, 49, 49, 2)    0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 149, 49, 49, 2)    8         
_________________________________________________________________
flatten_1 (Flatten)          (None, 715498)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               91583872  
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 91,584,043
Trainable params: 91,584,039
Non-trainable params: 4
_________________________________________________________________
None
best_model_wnw_invpyramid.h5


best_model_wnw_invpyramid.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 90, 50, 50, 1)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 89, 49, 49, 4)     36        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 44, 24, 24, 4)     0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 44, 24, 24, 4)     16        
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 43, 23, 23, 8)     264       
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 21, 11, 11, 8)     0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 21, 11, 11, 8)     32        
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 20, 10, 10, 16)    1040      
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 10, 5, 5, 16)      0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 10, 5, 5, 16)      64        
_________________________________________________________________
flatten_1 (Flatten)          (None, 4000)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               512128    
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 513,709
Trainable params: 513,653
Non-trainable params: 56
_________________________________________________________________
None
best_model_wnw_pyramid.h5


best_model_wnw_pyramid.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 90, 50, 50, 1)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 89, 49, 49, 8)     72        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 44, 24, 24, 8)     0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 44, 24, 24, 8)     32        
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 43, 23, 23, 4)     260       
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 21, 11, 11, 4)     0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 21, 11, 11, 4)     16        
_________________________________________________________________
flatten_1 (Flatten)          (None, 10164)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               1301120   
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 1,301,629
Trainable params: 1,301,605
Non-trainable params: 24
_________________________________________________________________
None
best_model_wnw_single.h5


best_model_wnw_single.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 90, 50, 50, 1)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 89, 49, 49, 4)     36        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 44, 24, 24, 4)     0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 44, 24, 24, 4)     16        
_________________________________________________________________
flatten_1 (Flatten)          (None, 101376)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               12976256  
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 12,976,437
Trainable params: 12,976,429
Non-trainable params: 8
_________________________________________________________________
None
best_model_wnw_single_of.h5


best_model_wnw_single_of.h5
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 89, 50, 50, 2)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 88, 49, 49, 2)     34        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 44, 24, 24, 2)     0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 44, 24, 24, 2)     8         
_________________________________________________________________
flatten_1 (Flatten)          (None, 50688)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               6488192   
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 6,488,363
Trainable params: 6,488,359
Non-trainable params: 4
_________________________________________________________________
None
